In [89]:
import pandas as pd #tablas https://pandas.pydata.org/docs/user_guide/pyarrow.html
import numpy as np #estadistica https://numpy.org/doc/1.25/user/index.html#user
import matplotlib.pyplot as plt #gráficos https://matplotlib.org/stable/plot_types/index.html
import seaborn as sns #gráficos https://seaborn.pydata.org/tutorial/regression.html
from sklearn import linear_model #modelo de regresion https://scikit-learn.org/stable/
from sklearn.preprocessing import MinMaxScaler # do not use the function Normalise() - it does something entirely different
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from datetime import datetime #https://docs.python.org/3/library/datetime.html
from datetime import timedelta #this is a good time to learn about dates and timestamps. You can find some info here:
from sklearn.linear_model import LogisticRegression
from sklearn.utils import resample
from imblearn.over_sampling import SMOTE
from sklearn.metrics import confusion_matrix
from sklearn.metrics import precision_score
from sklearn.metrics import recall_score
from sklearn.metrics import f1_score
from sklearn.neighbors import KNeighborsClassifier
from scipy.stats import ttest_1samp
import scipy.stats as st
from sklearn.neighbors import KNeighborsClassifier
from mlxtend.plotting import plot_decision_regions
import pandas as pd
import numpy as np
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass  # To get the password without showing the input

1. Bringing the option information

In [90]:
password = getpass()

In [91]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/raw_data'
engine = create_engine(connection_string)
query = '''SELECT * FROM options_raw_information_v0;'''

options = pd.read_sql_query(query, engine)

In [92]:
options

,expiration_date,company_id,contractSymbol,strike,Type,stock_price,in_the_money
0,2013-01-18,TSLA,TSLA230915C00001670,1.67,Call,2.301333,Yes
1,2013-01-18,TSLA,TSLA230915C00003330,3.33,Call,2.301333,No
2,2013-01-18,TSLA,TSLA230915C00005000,5.00,Call,2.301333,No
3,2013-01-18,TSLA,TSLA230915C00006670,6.67,Call,2.301333,No
4,2013-01-18,TSLA,TSLA230915C00008330,8.33,Call,2.301333,No
...,...,...,...,...,...,...,...
245198,2023-08-18,MSFT,MSFT230915P00495000,495.00,Put,316.480011,Yes
245199,2023-08-18,MSFT,MSFT230915P00500000,500.00,Put,316.480011,Yes
245200,2023-08-18,MSFT,MSFT230915P00505000,505.00,Put,316.480011,Yes
245201,2023-08-18,MSFT,MSFT230915P00510000,510.00,Put,316.480011,Yes
245202,2023-08-18,MSFT,MSFT230915P00520000,520.00,Put,316.480011,Yes

2. Change yes or no for 0 and 1, we want to bring the % of options that ended up in the money

In [93]:
options['in_the_money'] = options['in_the_money'].replace({'Yes': 1, 'No': 0})

In [94]:
options.head()

,expiration_date,company_id,contractSymbol,strike,Type,stock_price,in_the_money
0,2013-01-18,TSLA,TSLA230915C00001670,1.67,Call,2.301333,1
1,2013-01-18,TSLA,TSLA230915C00003330,3.33,Call,2.301333,0
2,2013-01-18,TSLA,TSLA230915C00005000,5.00,Call,2.301333,0
3,2013-01-18,TSLA,TSLA230915C00006670,6.67,Call,2.301333,0
4,2013-01-18,TSLA,TSLA230915C00008330,8.33,Call,2.301333,0

In [95]:
#TRANSFORMATIONS
#SUM IN THE MONEY VALUES FOR EXPIRATION DATE AND COMPANY ID / TOTAL OF CONTRACT SYMBOLS IN AN EXPIRATION DATE
#GROUP BY ALL THE INFORMATION BY DATE AND COMPANY_ID

In [96]:
grouped_options_for = options.groupby(['expiration_date', 'company_id',"Type"]).agg({
    'in_the_money': 'sum',
    'contractSymbol': 'count'
}).reset_index()

grouped_options_for.tail(20)

     expiration_date company_id  Type  in_the_money  contractSymbol
1596      2023-07-21       MSFT  Call            59              99
1597      2023-07-21       MSFT   Put            35              94
1598      2023-07-21        NIO  Call            15              34
1599      2023-07-21        NIO   Put            18              32
1600      2023-07-21       TSLA  Call           103             289
1601      2023-07-21       TSLA   Put           182             285
1602      2023-08-18       AAPL  Call            27              59
1603      2023-08-18       AAPL   Put            25              52
1604      2023-08-18       AMZN  Call            83             233
1605      2023-08-18       AMZN   Put           156             239
1606      2023-08-18       GOOG  Call            84             177
1607      2023-08-18       GOOG   Put            80             164
1608      2023-08-18       META  Call            63             130
1609      2023-08-18       META   Put            47             110
1610      2023-08-18       MSFT  Call            48              99
1611      2023-08-18       MSFT   Put            46              94
1612      2023-08-18        NIO  Call            15              34
1613      2023-08-18        NIO   Put            18              32
1614      2023-08-18       TSLA  Call            81             289
1615      2023-08-18       TSLA   Put           204             285

In [97]:
grouped_options_for["per_in_the_money"] = grouped_options_for["in_the_money"]/grouped_options_for["contractSymbol"]
grouped_options_for

,expiration_date,company_id,Type,in_the_money,contractSymbol,per_in_the_money
0,2013-01-18,AAPL,Call,0,59,0.000000
1,2013-01-18,AAPL,Put,52,52,1.000000
2,2013-01-18,AMZN,Call,0,233,0.000000
3,2013-01-18,AMZN,Put,239,239,1.000000
4,2013-01-18,GOOG,Call,0,177,0.000000
...,...,...,...,...,...,...
1611,2023-08-18,MSFT,Put,46,94,0.489362
1612,2023-08-18,NIO,Call,15,34,0.441176
1613,2023-08-18,NIO,Put,18,32,0.562500
1614,2023-08-18,TSLA,Call,81,289,0.280277
1615,2023-08-18,TSLA,Put,204,285,0.715789

We are going to keep at the end only the % of options that were in the money, but we want to keep as column, the % of those that were in the money, how many are calls and how many are puts

In [98]:
select = grouped_options_for[["Type","per_in_the_money"]]
select

      Type  per_in_the_money
0     Call          0.000000
1      Put          1.000000
2     Call          0.000000
3      Put          1.000000
4     Call          0.000000
...    ...               ...
1611   Put          0.489362
1612  Call          0.441176
1613   Put          0.562500
1614  Call          0.280277
1615   Put          0.715789

[1616 rows x 2 columns]

In [99]:
select_call = select[select['Type'] == 'Call']
select_call

      Type  per_in_the_money
0     Call          0.000000
2     Call          0.000000
4     Call          0.000000
6     Call          0.038462
8     Call          0.000000
...    ...               ...
1606  Call          0.474576
1608  Call          0.484615
1610  Call          0.484848
1612  Call          0.441176
1614  Call          0.280277

[808 rows x 2 columns]

In [100]:
select_call_pivot = select_call.pivot(columns=('Type'), values='per_in_the_money', ).reset_index(drop = True)
select_call_pivot

Type      Call
0     0.000000
1     0.000000
2     0.000000
3     0.038462
4     0.000000
..         ...
803   0.474576
804   0.484615
805   0.484848
806   0.441176
807   0.280277

[808 rows x 1 columns]

In [101]:
select_put= select[select['Type'] == 'Put']
select_put

     Type  per_in_the_money
1     Put          1.000000
3     Put          1.000000
5     Put          1.000000
7     Put          0.954545
9     Put          1.000000
...   ...               ...
1607  Put          0.487805
1609  Put          0.427273
1611  Put          0.489362
1613  Put          0.562500
1615  Put          0.715789

[808 rows x 2 columns]

In [102]:
select_put_pivot = select_put.pivot(columns=('Type'), values='per_in_the_money', ).reset_index(drop = True)
select_put_pivot

Type       Put
0     1.000000
1     1.000000
2     1.000000
3     0.954545
4     1.000000
..         ...
803   0.487805
804   0.427273
805   0.489362
806   0.562500
807   0.715789

[808 rows x 1 columns]

In [103]:
call_put_info = pd.concat([select_call_pivot,select_put_pivot], axis = 1)
call_put_info

Type      Call       Put
0     0.000000  1.000000
1     0.000000  1.000000
2     0.000000  1.000000
3     0.038462  0.954545
4     0.000000  1.000000
..         ...       ...
803   0.474576  0.487805
804   0.484615  0.427273
805   0.484848  0.489362
806   0.441176  0.562500
807   0.280277  0.715789

[808 rows x 2 columns]

Now we ge the overall and after we concat all, so we have ALL the info.

In [104]:
grouped_options = options.groupby(['expiration_date', 'company_id']).agg({
    'in_the_money': 'sum',
    'contractSymbol': 'count'
}).reset_index()

grouped_options.tail(20)

    expiration_date company_id  in_the_money  contractSymbol
788      2023-06-16       AMZN           239             472
789      2023-06-16       GOOG           164             341
790      2023-06-16       META           110             240
791      2023-06-16       MSFT            94             193
792      2023-06-16        NIO            33              66
793      2023-06-16       TSLA           285             574
794      2023-07-21       AAPL            52             111
795      2023-07-21       AMZN           238             472
796      2023-07-21       GOOG           164             341
797      2023-07-21       META           110             240
798      2023-07-21       MSFT            94             193
799      2023-07-21        NIO            33              66
800      2023-07-21       TSLA           285             574
801      2023-08-18       AAPL            52             111
802      2023-08-18       AMZN           239             472
803      2023-08-18       GOOG           164             341
804      2023-08-18       META           110             240
805      2023-08-18       MSFT            94             193
806      2023-08-18        NIO            33              66
807      2023-08-18       TSLA           285             574

In [109]:
grouped_options["total_percentage_in_the_money"] = grouped_options["in_the_money"]/grouped_options["contractSymbol"]
grouped_options

,expiration_date,company_id,in_the_money,contractSymbol,total_percentage_in_the_money
0,2013-01-18,AAPL,52,111,0.468468
1,2013-01-18,AMZN,239,472,0.506356
2,2013-01-18,GOOG,164,341,0.480938
3,2013-01-18,META,110,240,0.458333
4,2013-01-18,MSFT,94,193,0.487047
...,...,...,...,...,...
803,2023-08-18,GOOG,164,341,0.480938
804,2023-08-18,META,110,240,0.458333
805,2023-08-18,MSFT,94,193,0.487047
806,2023-08-18,NIO,33,66,0.500000
807,2023-08-18,TSLA,285,574,0.496516

In [110]:
options_almost_complete_info = pd.concat([grouped_options,call_put_info], axis = 1)
options_almost_complete_info

,expiration_date,company_id,in_the_money,contractSymbol,total_percentage_in_the_money,Call,Put
0,2013-01-18,AAPL,52,111,0.468468,0.000000,1.000000
1,2013-01-18,AMZN,239,472,0.506356,0.000000,1.000000
2,2013-01-18,GOOG,164,341,0.480938,0.000000,1.000000
3,2013-01-18,META,110,240,0.458333,0.038462,0.954545
4,2013-01-18,MSFT,94,193,0.487047,0.000000,1.000000
...,...,...,...,...,...,...,...
803,2023-08-18,GOOG,164,341,0.480938,0.474576,0.487805
804,2023-08-18,META,110,240,0.458333,0.484615,0.427273
805,2023-08-18,MSFT,94,193,0.487047,0.484848,0.489362
806,2023-08-18,NIO,33,66,0.500000,0.441176,0.562500
807,2023-08-18,TSLA,285,574,0.496516,0.280277,0.715789

THIS INFORMATION IT'S ALREADY PRETTY NICE, BUT WE ARE GOING TO ADD THE VOLUME. IMPORTANT: META ONLY HAS VOLUME FROM 2021 ONWARDS AND NIO FROM 2018, FUN WITH NAN COMING SOON...

In [111]:
query = '''SELECT * FROM options_volume_2013_2023;'''

options_volume = pd.read_sql_query(query, engine)

In [145]:
expiration_date = pd.read_csv("expiration_date_KEY.csv")
expiration_date

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [149]:
expiration_date = pd.to_datetime(expiration_date['expiration_date'])

In [150]:
options_volume[options_volume['Trade Date'] == '2013-01-18']

      Trade Date company_id    Volume
12    2013-01-18       TSLA    473000
3930  2013-01-18       MSFT   7464000
6959  2013-01-18       GOOG   9878000
9639  2013-01-18       AMZN   9855000
12321 2013-01-18       AAPL  47851000

In [151]:
options_volume.shape

(14991, 3)

In [152]:
volume_date = options_volume .merge(expiration_date, how='left', left_on='Trade Date', right_on='expiration_date')

In [153]:
volume_date

      Trade Date company_id    Volume expiration_date
0     2013-01-02       TSLA    654000             NaT
1     2013-01-03       TSLA    186000             NaT
2     2013-01-04       TSLA    295000             NaT
3     2013-01-07       TSLA    299000             NaT
4     2013-01-08       TSLA    236000             NaT
...          ...        ...       ...             ...
14986 2023-08-22       AAPL  49060000             NaT
14987 2023-08-23       AAPL  72899000             NaT
14988 2023-08-24       AAPL  57083000             NaT
14989 2023-08-25       AAPL  59877000             NaT
14990 2023-08-28       AAPL  36716000             NaT

[14991 rows x 4 columns]

AND HERE WE RUN OUT SUPER RANGE CODE AGAIN, BUUUT WE NEED TO TAKE INTO ACCOUNT NOW WE HAVE 7 DIFFERENT COMPANIES. TRYING FIRST ALL TOGETHER, IF NOT, ONE BY ONE.

In [154]:
indexes = volume_date [volume_date ['expiration_date'].notnull()].index

In [155]:
indexes

Int64Index([   12,    31,    50,    74,    94,   118,   137,   157,   181,
              201,
            ...
            14798, 14817, 14839, 14859, 14878, 14902, 14922, 14941, 14964,
            14984],
           dtype='int64', length=699)

In [156]:
indexes_0 = np.insert(indexes, 0, 0)
indexes_0

Int64Index([    0,    12,    31,    50,    74,    94,   118,   137,   157,
              181,
            ...
            14798, 14817, 14839, 14859, 14878, 14902, 14922, 14941, 14964,
            14984],
           dtype='int64', length=700)

In [157]:
def convert_to_ranges(index_array):
    ranges = []
    start_index = index_array[0]
    for i in range(1, len(index_array)):
        ranges.append((start_index, index_array[i]+1))
        start_index = index_array[i]+1
    ranges.append((start_index, index_array[-1]))
    return ranges

index_ranges = convert_to_ranges(indexes_0) 
index_ranges

[(0, 13),
 (13, 32),
 (32, 51),
 (51, 75),
 (75, 95),
 (95, 119),
 (119, 138),
 (138, 158),
 (158, 182),
 (182, 202),
 (202, 222),
 (222, 246),
 (246, 264),
 (264, 287),
 (287, 307),
 (307, 346),
 (346, 370),
 (370, 389),
 (389, 409),
 (409, 433),
 (433, 453),
 (453, 478),
 (478, 497),
 (497, 515),
 (515, 538),
 (538, 558),
 (558, 577),
 (577, 597),
 (597, 621),
 (621, 640),
 (640, 665),
 (665, 684),
 (684, 704),
 (704, 729),
 (729, 748),
 (748, 766),
 (766, 789),
 (789, 809),
 (809, 828),
 (828, 853),
 (853, 872),
 (872, 891),
 (891, 916),
 (916, 935),
 (935, 960),
 (960, 980),
 (980, 999),
 (999, 1021),
 (1021, 1041),
 (1041, 1060),
 (1060, 1084),
 (1084, 1104),
 (1104, 1123),
 (1123, 1147),
 (1147, 1167),
 (1167, 1186),
 (1186, 1211),
 (1211, 1231),
 (1231, 1250),
 (1250, 1272),
 (1272, 1292),
 (1292, 1311),
 (1311, 1335),
 (1335, 1355),
 (1355, 1374),
 (1374, 1398),
 (1398, 1418),
 (1418, 1442),
 (1442, 1462),
 (1462, 1482),
 (1482, 1505),
 (1505, 1523),
 (1523, 1542),
 (1542, 1561),
 (1561, 1605),
 (1605, 1629),
 (1629, 1648),
 (1648, 1668),
 (1668, 1692),
 (1692, 1712),
 (1712, 1732),
 (1732, 1756),
 (1756, 1774),
 (1774, 1797),
 (1797, 1817),
 (1817, 1836),
 (1836, 1856),
 (1856, 1880),
 (1880, 1899),
 (1899, 1924),
 (1924, 1943),
 (1943, 1963),
 (1963, 1988),
 (1988, 2007),
 (2007, 2025),
 (2025, 2048),
 (2048, 2068),
 (2068, 2087),
 (2087, 2112),
 (2112, 2131),
 (2131, 2150),
 (2150, 2175),
 (2175, 2194),
 (2194, 2214),
 (2214, 2239),
 (2239, 2258),
 (2258, 2281),
 (2281, 2301),
 (2301, 2320),
 (2320, 2364),
 (2364, 2383),
 (2383, 2401),
 (2401, 2426),
 (2426, 2445),
 (2445, 2470),
 (2470, 2490),
 (2490, 2509),
 (2509, 2531),
 (2531, 2551),
 (2551, 2570),
 (2570, 2594),
 (2594, 2614),
 (2614, 2633),
 (2633, 2656),
 (2656, 2676),
 (2676, 2698),
 (2698, 2718),
 (2718, 2741),
 (2741, 2759),
 (2759, 2778),
 (2778, 2797),
 (2797, 2841),
 (2841, 2865),
 (2865, 2884),
 (2884, 2904),
 (2904, 2928),
 (2928, 2948),
 (2948, 2968),
 (2968, 2992),
 (2992, 3010),
 (3010, 3033),
 (3033, 3053),
 (3053, 3072),
 (3072, 3092),
 (3092, 3116),
 (3116, 3135),
 (3135, 3160),
 (3160, 3179),
 (3179, 3199),
 (3199, 3224),
 (3224, 3243),
 (3243, 3261),
 (3261, 3284),
 (3284, 3304),
 (3304, 3323),
 (3323, 3348),
 (3348, 3367),
 (3367, 3386),
 (3386, 3411),
 (3411, 3430),
 (3430, 3450),
 (3450, 3475),
 (3475, 3494),
 (3494, 3517),
 (3517, 3537),
 (3537, 3556),
 (3556, 3600),
 (3600, 3619),
 (3619, 3637),
 (3637, 3662),
 (3662, 3681),
 (3681, 3706),
 (3706, 3726),
 (3726, 3745),
 (3745, 3767),
 (3767, 3787),
 (3787, 3806),
 (3806, 3830),
 (3830, 3850),
 (3850, 3869),
 (3869, 3892),
 (3892, 3912),
 (3912, 3931),
 (3931, 3950),
 (3950, 3969),
 (3969, 3993),
 (3993, 4013),
 (4013, 4037),
 (4037, 4056),
 (4056, 4076),
 (4076, 4100),
 (4100, 4120),
 (4120, 4140),
 (4140, 4164),
 (4164, 4182),
 (4182, 4205),
 (4205, 4225),
 (4225, 4264),
 (4264, 4288),
 (4288, 4307),
 (4307, 4327),
 (4327, 4351),
 (4351, 4371),
 (4371, 4396),
 (4396, 4415),
 (4415, 4433),
 (4433, 4456),
 (4456, 4476),
 (4476, 4495),
 (4495, 4515),
 (4515, 4539),
 (4539, 4558),
 (4558, 4583),
 (4583, 4602),
 (4602, 4622),
 (4622, 4647),
 (4647, 4666),
 (4666, 4684),
 (4684, 4707),
 (4707, 4727),
 (4727, 4746),
 (4746, 4771),
 (4771, 4790),
 (4790, 4809),
 (4809, 4834),
 (4834, 4853),
 (4853, 4878),
 (4878, 4898),
 (4898, 4917),
 (4917, 4939),
 (4939, 4959),
 (4959, 4978),
 (4978, 5002),
 (5002, 5022),
 (5022, 5041),
 (5041, 5065),
 (5065, 5085),
 (5085, 5104),
 (5104, 5129),
 (5129, 5149),
 (5149, 5168),
 (5168, 5190),
 (5190, 5210),
 (5210, 5229),
 (5229, 5253),
 (5253, 5273),
 (5273, 5292),
 (5292, 5316),
 (5316, 5336),
 (5336, 5360),
 (5360, 5380),
 (5380, 5400),
 (5400, 5423),
 (5423, 5441),
 (5441, 5460),
 (5460, 5479),
 (5479, 5523),
 (5523, 5547),
 (5547, 5566),
 (5566, 5586),
 (5586, 5610),
 (5610, 5630),
 (5630, 5650),
 (5650, 5674),
 (5674, 5692),
 (5692, 5715),
 (5715, 5735),
 (5735, 5754),
 (5754, 5774),
 (5774, 5798),
 (5798, 5817),
 (5817, 5842),
 (5842, 5861),
 (5861, 5881),
 (5881, 5906),
 (5906, 5925),
 (5925, 5943),
 (5943, 5966),
 (5966, 5986),
 (5986, 6005),
 (6005, 6030),
 (6030, 6049),
 (6049, 6068),
 (6068, 6093),
 (6093, 6112),
 (6112, 6132),
 (6132, 6157),
 (6157, 6176),
 (6176, 6199),
 (6199, 6219),
 (6219, 6238),
 (6238, 6282),
 (6282, 6301),
 (6301, 6319),
 (6319, 6344),
 (6344, 6363),
 (6363, 6388),
 (6388, 6408),
 (6408, 6427),
 (6427, 6449),
 (6449, 6469),
 (6469, 6488),
 (6488, 6512),
 (6512, 6532),
 (6532, 6551),
 (6551, 6574),
 (6574, 6594),
 (6594, 6613),
 (6613, 6636),
 (6636, 6648),
 (6648, 6666),
 (6666, 6691),
 (6691, 6710),
 (6710, 6735),
 (6735, 6755),
 (6755, 6774),
 (6774, 6796),
 (6796, 6816),
 (6816, 6835),
 (6835, 6859),
 (6859, 6879),
 (6879, 6898),
 (6898, 6921),
 (6921, 6941),
 (6941, 6960),
 (6960, 6979),
 (6979, 6998),
 (6998, 7022),
 (7022, 7042),
 (7042, 7066),
 (7066, 7085),
 (7085, 7105),
 (7105, 7129),
 (7129, 7149),
 (7149, 7169),
 (7169, 7193),
 (7193, 7211),
 (7211, 7234),
 (7234, 7254),
 (7254, 7292),
 (7292, 7316),
 (7316, 7335),
 (7335, 7355),
 (7355, 7379),
 (7379, 7399),
 (7399, 7424),
 (7424, 7443),
 (7443, 7461),
 (7461, 7484),
 (7484, 7504),
 (7504, 7523),
 (7523, 7542),
 (7542, 7566),
 (7566, 7585),
 (7585, 7610),
 (7610, 7629),
 (7629, 7649),
 (7649, 7674),
 (7674, 7693),
 (7693, 7711),
 (7711, 7734),
 (7734, 7754),
 (7754, 7773),
 (7773, 7798),
 (7798, 7817),
 (7817, 7836),
 (7836, 7861),
 (7861, 7880),
 (7880, 7905),
 (7905, 7925),
 (7925, 7944),
 (7944, 7966),
 (7966, 7986),
 (7986, 8005),
 (8005, 8029),
 (8029, 8049),
 (8049, 8068),
 (8068, 8092),
 (8092, 8112),
 (8112, 8131),
 (8131, 8156),
 (8156, 8176),
 (8176, 8195),
 (8195, 8217),
 (8217, 8237),
 (8237, 8256),
 (8256, 8280),
 (8280, 8300),
 (8300, 8319),
 (8319, 8343),
 (8343, 8363),
 (8363, 8387),
 (8387, 8407),
 (8407, 8427),
 (8427, 8450),
 (8450, 8468),
 (8468, 8487),
 (8487, 8506),
 (8506, 8550),
 (8550, 8574),
 (8574, 8593),
 (8593, 8613),
 (8613, 8637),
 (8637, 8657),
 (8657, 8677),
 (8677, 8701),
 (8701, 8719),
 (8719, 8742),
 (8742, 8762),
 (8762, 8781),
 (8781, 8801),
 (8801, 8825),
 (8825, 8844),
 (8844, 8869),
 (8869, 8888),
 (8888, 8908),
 (8908, 8933),
 (8933, 8952),
 (8952, 8970),
 (8970, 8993),
 (8993, 9013),
 (9013, 9032),
 (9032, 9057),
 (9057, 9076),
 (9076, 9095),
 (9095, 9120),
 (9120, 9139),
 (9139, 9159),
 (9159, 9184),
 (9184, 9203),
 (9203, 9226),
 (9226, 9246),
 (9246, 9265),
 (9265, 9309),
 (9309, 9328),
 (9328, 9346),
 (9346, 9371),
 (9371, 9390),
 (9390, 9415),
 (9415, 9435),
 (9435, 9454),
 (9454, 9476),
 (9476, 9496),
 (9496, 9515),
 (9515, 9539),
 (9539, 9559),
 (9559, 9578),
 (9578, 9601),
 (9601, 9621),
 (9621, 9640),
 (9640, 9659),
 (9659, 9678),
 (9678, 9702),
 (9702, 9722),
 (9722, 9746),
 (9746, 9765),
 (9765, 9785),
 (9785, 9809),
 (9809, 9829),
 (9829, 9849),
 (9849, 9873),
 (9873, 9891),
 (9891, 9914),
 (9914, 9934),
 (9934, 9973),
 (9973, 9997),
 (9997, 10016),
 (10016, 10036),
 (10036, 10060),
 (10060, 10080),
 (10080, 10105),
 (10105, 10124),
 (10124, 10142),
 (10142, 10165),
 (10165, 10185),
 (10185, 10204),
 (10204, 10224),
 (10224, 10248),
 (10248, 10267),
 (10267, 10292),
 (10292, 10311),
 (10311, 10331),
 (10331, 10356),
 (10356, 10375),
 (10375, 10393),
 (10393, 10416),
 (10416, 10436),
 (10436, 10455),
 (10455, 10480),
 (10480, 10499),
 (10499, 10518),
 (10518, 10543),
 (10543, 10562),
 (10562, 10587),
 (10587, 10607),
 (10607, 10626),
 (10626, 10648),
 (10648, 10668),
 (10668, 10687),
 (10687, 10711),
 (10711, 10731),
 (10731, 10750),
 (10750, 10774),
 (10774, 10794),
 (10794, 10813),
 (10813, 10838),
 (10838, 10858),
 (10858, 10877),
 (10877, 10899),
 (10899, 10919),
 (10919, 10938),
 (10938, 10962),
 (10962, 10982),
 (10982, 11001),
 (11001, 11025),
 (11025, 11045),
 (11045, 11069),
 (11069, 11089),
 (11089, 11109),
 (11109, 11132),
 (11132, 11150),
 (11150, 11169),
 (11169, 11188),
 (11188, 11232),
 (11232, 11256),
 (11256, 11275),
 (11275, 11295),
 (11295, 11319),
 (11319, 11339),
 (11339, 11359),
 (11359, 11383),
 (11383, 11401),
 (11401, 11424),
 (11424, 11444),
 (11444, 11463),
 (11463, 11483),
 (11483, 11507),
 (11507, 11526),
 (11526, 11551),
 (11551, 11570),
 (11570, 11590),
 (11590, 11615),
 (11615, 11634),
 (11634, 11652),
 (11652, 11675),
 (11675, 11695),
 (11695, 11714),
 (11714, 11739),
 (11739, 11758),
 (11758, 11777),
 (11777, 11802),
 (11802, 11821),
 (11821, 11841),
 (11841, 11866),
 (11866, 11885),
 (11885, 11908),
 (11908, 11928),
 (11928, 11947),
 (11947, 11991),
 (11991, 12010),
 (12010, 12028),
 (12028, 12053),
 (12053, 12072),
 (12072, 12097),
 (12097, 12117),
 (12117, 12136),
 (12136, 12158),
 (12158, 12178),
 (12178, 12197),
 (12197, 12221),
 (12221, 12241),
 (12241, 12260),
 (12260, 12283),
 (12283, 12303),
 (12303, 12322),
 (12322, 12341),
 (12341, 12360),
 (12360, 12384),
 (12384, 12404),
 (12404, 12428),
 (12428, 12447),
 (12447, 12467),
 (12467, 12491),
 (12491, 12511),
 (12511, 12531),
 (12531, 12555),
 (12555, 12573),
 (12573, 12596),
 (12596, 12616),
 (12616, 12655),
 (12655, 12679),
 (12679, 12698),
 (12698, 12718),
 (12718, 12742),
 (12742, 12762),
 (12762, 12787),
 (12787, 12806),
 (12806, 12824),
 (12824, 12847),
 (12847, 12867),
 (12867, 12886),
 (12886, 12906),
 (12906, 12930),
 (12930, 12949),
 (12949, 12974),
 (12974, 12993),
 (12993, 13013),
 (13013, 13038),
 (13038, 13057),
 (13057, 13075),
 (13075, 13098),
 (13098, 13118),
 (13118, 13137),
 (13137, 13162),
 (13162, 13181),
 (13181, 13200),
 (13200, 13225),
 (13225, 13244),
 (13244, 13269),
 (13269, 13289),
 (13289, 13308),
 (13308, 13330),
 (13330, 13350),
 (13350, 13369),
 (13369, 13393),
 (13393, 13413),
 (13413, 13432),
 (13432, 13456),
 (13456, 13476),
 (13476, 13495),
 (13495, 13520),
 (13520, 13540),
 (13540, 13559),
 (13559, 13581),
 (13581, 13601),
 (13601, 13620),
 (13620, 13644),
 (13644, 13664),
 (13664, 13683),
 (13683, 13707),
 (13707, 13727),
 (13727, 13751),
 (13751, 13771),
 (13771, 13791),
 (13791, 13814),
 (13814, 13832),
 (13832, 13851),
 (13851, 13870),
 (13870, 13914),
 (13914, 13938),
 (13938, 13957),
 (13957, 13977),
 (13977, 14001),
 (14001, 14021),
 (14021, 14041),
 (14041, 14065),
 (14065, 14083),
 (14083, 14106),
 (14106, 14126),
 (14126, 14145),
 (14145, 14165),
 (14165, 14189),
 (14189, 14208),
 (14208, 14233),
 (14233, 14252),
 (14252, 14272),
 (14272, 14297),
 (14297, 14316),
 (14316, 14334),
 (14334, 14357),
 (14357, 14377),
 (14377, 14396),
 (14396, 14421),
 (14421, 14440),
 (14440, 14459),
 (14459, 14484),
 (14484, 14503),
 (14503, 14523),
 (14523, 14548),
 (14548, 14567),
 (14567, 14590),
 (14590, 14610),
 (14610, 14629),
 (14629, 14673),
 (14673, 14692),
 (14692, 14710),
 (14710, 14735),
 (14735, 14754),
 (14754, 14779),
 (14779, 14799),
 (14799, 14818),
 (14818, 14840),
 (14840, 14860),
 (14860, 14879),
 (14879, 14903),
 (14903, 14923),
 (14923, 14942),
 (14942, 14965),
 (14965, 14985),
 (14985, 14984)]

In [159]:
volume_date.iloc[935:960]

    Trade Date company_id    Volume expiration_date
935 2016-09-19       TSLA  12245000             NaT
936 2016-09-20       TSLA   9140000             NaT
937 2016-09-21       TSLA  11908000             NaT
938 2016-09-22       TSLA  13432000             NaT
939 2016-09-23       TSLA  16422000             NaT
940 2016-09-26       TSLA   6370000             NaT
941 2016-09-27       TSLA   8693000             NaT
942 2016-09-28       TSLA   6137000             NaT
943 2016-09-29       TSLA  10050000             NaT
944 2016-09-30       TSLA  13437000             NaT
945 2016-10-03       TSLA  16518000             NaT
946 2016-10-04       TSLA   8911000             NaT
947 2016-10-05       TSLA   6118000             NaT
948 2016-10-06       TSLA  18958000             NaT
949 2016-10-07       TSLA  22338000             NaT
950 2016-10-10       TSLA   9550000             NaT
951 2016-10-11       TSLA   7510000             NaT
952 2016-10-12       TSLA   4815000             NaT
953 2016-10-13       TSLA   7383000             NaT
954 2016-10-14       TSLA  15635000             NaT
955 2016-10-17       TSLA  10037000             NaT
956 2016-10-18       TSLA  13744000             NaT
957 2016-10-19       TSLA  20036000             NaT
958 2016-10-20       TSLA  16374000             NaT
959 2016-10-21       TSLA  18181000      2016-10-21

In [162]:
volume_sum = [volume_date.loc[start:end, 'Volume'].sum() for start, end in index_ranges]

In [163]:
volume_sum

[5770000,
 21980000,
 23124000,
 56304000,
 305949000,
 459994000,
 347655000,
 308348000,
 340539000,
 275899000,
 181993000,
 114977000,
 68170000,
 115743000,
 125151000,
 193684000,
 99114000,
 112177000,
 168859000,
 289335000,
 265271000,
 294881000,
 221000000,
 196498000,
 306633000,
 321550000,
 295096000,
 395368000,
 324081000,
 410597000,
 566447000,
 400386000,
 276414000,
 318952000,
 188859000,
 142616000,
 155590000,
 192416000,
 486937000,
 501737000,
 360178000,
 424704000,
 378187000,
 377492000,
 311066000,
 279861000,
 213212000,
 277008000,
 364475000,
 385439000,
 558611000,
 617858000,
 740441000,
 735112000,
 428109000,
 349921000,
 539783000,
 481158000,
 436080000,
 587471000,
 412737000,
 382070000,
 604817000,
 419715000,
 563408000,
 639093000,
 778368000,
 629781000,
 629302000,
 534732000,
 411388000,
 342333000,
 341059000,
 513116000,
 1234712000,
 995559000,
 478371000,
 637886000,
 585244000,
 614800000,
 855392000,
 1023879000,
 1308288000,
 2203490000,
 1513471000,
 1448544000,
 1172856000,
 979166000,
 732261000,
 895528000,
 1935437000,
 1498807000,
 1531318000,
 1720482000,
 1766149000,
 1361096000,
 1715755000,
 2695490000,
 3482062000,
 2273853000,
 2363641000,
 2700143000,
 2255796000,
 2494898000,
 3954113000,
 2068598000,
 3032815000,
 2194637000,
 2123940000,
 5881604000,
 2964090000,
 2459603000,
 3357764000,
 3208353000,
 4739612000,
 3788348000,
 3451248000,
 4700520000,
 5398135000,
 3443923000,
 3729448000,
 3342549000,
 4128800000,
 3930746000,
 3104017000,
 995166000,
 48243000,
 49103000,
 28198000,
 85099000,
 317328000,
 216310000,
 158149000,
 205934000,
 104259000,
 108679000,
 234178000,
 176433000,
 200246000,
 644909000,
 527188000,
 327611000,
 139487000,
 161806000,
 768519000,
 1184632000,
 1011704000,
 1337679000,
 1291535000,
 4025853000,
 2791977000,
 1627417000,
 1179902000,
 1221723000,
 936621000,
 1082148000,
 1128395000,
 1212919000,
 1113162000,
 694353000,
 628876000,
 1001773000,
 819572000,
 926200000,
 625695000,
 731069000,
 1203881000,
 575065000,
 449569000,
 391702000,
 425785000,
 457239000,
 400818000,
 344225000,
 222952000,
 249781000,
 176503000,
 193205000,
 163277000,
 397084000,
 366546000,
 465235000,
 127059000,
 98026000,
 63123000,
 163881000,
 163862000,
 148014000,
 194789000,
 164440000,
 261272000,
 139159000,
 178262000,
 190383000,
 108955000,
 179586000,
 154001000,
 304723000,
 111971000,
 171615000,
 230294000,
 219868000,
 156337000,
 185919000,
 99263000,
 125450000,
 416271000,
 199609000,
 181988000,
 409475000,
 255342000,
 159905000,
 414448000,
 252842000,
 219995000,
 428082000,
 362604000,
 350065000,
 442427000,
 216178000,
 237659000,
 387628000,
 251132000,
 319119000,
 378882000,
 225088000,
 438707000,
 356927000,
 245043000,
 224908000,
 395939000,
 195221000,
 344476000,
 409057000,
 294401000,
 381080000,
 212518000,
 157420000,
 283268000,
 308317000,
 269248000,
 298341000,
 584216000,
 315357000,
 572604000,
 410229000,
 309368000,
 493641000,
 329405000,
 358639000,
 400891000,
 537026000,
 549096000,
 350068000,
 350618000,
 315636000,
 932421000,
 487179000,
 452495000,
 655926000,
 748336000,
 509299000,
 672541000,
 444107000,
 448586000,
 1484916000,
 1327310000,
 1170838000,
 734237000,
 972963000,
 735582000,
 1066454000,
 1034398000,
 652287000,
 798158000,
 628528000,
 561101000,
 789595000,
 473049000,
 545096000,
 695177000,
 443312000,
 662231000,
 858086000,
 593627000,
 566705000,
 858306000,
 669966000,
 990133000,
 813091000,
 518737000,
 1354357000,
 543314000,
 493411000,
 796328000,
 487680000,
 667103000,
 658785000,
 433421000,
 455633000,
 779785000,
 500674000,
 606629000,
 656649000,
 559013000,
 638027000,
 592811000,
 125096000,
 20100000,
 279708000,
 626416000,
 940950000,
 630762000,
 843304000,
 1633874000,
 638524000,
 567596000,
 992280000,
 686728000,
 550492000,
 700039000,
 540124000,
 769772000,
 609269000,
 216438000,
 130569000,
 123055000,
 113082000,
 136992000,
 210441000,
 167325000,
 148780000,
 116105000,
 73392000,
 62044000,
 44873000,
 60503000,
 103548000,
 64505000,
 68131000,
 24446000,
 23690000,
 27115000,
 29433000,
 41949000,
 41803000,
 53816000,
 73191000,
 122374000,
 116709000,
 109459000,
 83468000,
 97577000,
 131883000,
 126085000,
 80923000,
 75652000,
 83796000,
 70438000,
 58083000,
 92434000,
 56640000,
 65429000,
 128180000,
 80258000,
 82456000,
 93555000,
 55103000,
 72317000,
 62645000,
 36154000,
 23856000,
 35741000,
 35052000,
 53869000,
 69915000,
 68883000,
 69116000,
 48289000,
 33892000,
 52909000,
 42880000,
 44481000,
 49072000,
 51828000,
 55840000,
 66979000,
 75249000,
 62143000,
 64505000,
 64245000,
 56266000,
 37988000,
 40619000,
 42692000,
 29473000,
 43859000,
 29774000,
 110007000,
 45037000,
 30124000,
 76943000,
 61397000,
 50918000,
 49479000,
 44855000,
 51419000,
 80195000,
 61303000,
 41139000,
 45520000,
 48547000,
 43771000,
 33322000,
 27131000,
 29648000,
 56461000,
 23058000,
 21277000,
 32183000,
 16537000,
 19231000,
 34195000,
 26476000,
 33354000,
 34693000,
 29963000,
 30319000,
 46452000,
 24090000,
 25704000,
 44704000,
 37817000,
 69520000,
 38406000,
 65334000,
 397330000,
 177126000,
 374549000,
 629164000,
 371930000,
 290099000,
 619101000,
 457842000,
 396198000,
 512858000,
 334393000,
 255294000,
 260441000,
 190947000,
 228571000,
 111197000,
 103105000,
 145736000,
 119055000,
 89399000,
 108099000,
 101549000,
 82374000,
 76316000,
 46492000,
 38853000,
 128840000,
 72622000,
 150261000,
 78982000,
 71301000,
 261272000,
 252389000,
 157929000,
 274954000,
 193821000,
 129254000,
 281827000,
 157131000,
 173129000,
 260894000,
 224540000,
 229602000,
 383369000,
 223970000,
 201193000,
 256752000,
 204926000,
 191972000,
 263865000,
 157280000,
 274760000,
 435053000,
 264102000,
 327328000,
 333924000,
 278346000,
 447906000,
 394039000,
 273278000,
 292223000,
 302954000,
 221879000,
 356563000,
 362347000,
 392115000,
 341600000,
 287511000,
 248168000,
 310395000,
 261894000,
 278309000,
 312332000,
 384484000,
 300645000,
 427179000,
 288104000,
 295362000,
 456838000,
 421178000,
 572544000,
 470016000,
 500621000,
 639513000,
 454082000,
 368438000,
 318746000,
 778067000,
 445998000,
 333487000,
 386194000,
 473116000,
 359905000,
 325656000,
 470011000,
 538246000,
 642247000,
 559593000,
 478508000,
 278093000,
 357154000,
 292983000,
 301820000,
 274286000,
 402987000,
 433472000,
 356812000,
 415379000,
 606504000,
 418207000,
 474320000,
 676027000,
 520092000,
 815197000,
 694467000,
 753188000,
 669613000,
 1013681000,
 559089000,
 616345000,
 597682000,
 566818000,
 1360234000,
 2132060000,
 1742758000,
 2244072000,
 1222268000,
 1448728000,
 2479700000,
 1305866000,
 1227477000,
 1281211000,
 763690000,
 1084069000,
 1158482000,
 1021811000,
 1201559000,
 882744000,
 791940000,
 718285000,
 580751000,
 657740000,
 796080000,
 759182000,
 485852000,
 740092000,
 1016021000,
 634131000,
 449299000,
 334853000,
 294840000,
 394624000,
 254781000,
 611685000,
 663127000,
 583859000,
 1117846000,
 1972062000,
 1867274000,
 1455665000,
 1338170000,
 1570697000,
 2915081000,
 3174400000,
 2260647000,
 3328930000,
 2497975000,
 2422402000,
 4971122000,
 3633158000,
 2312779000,
 2602642000,
 2155393000,
 2031464000,
 2035855000,
 1380787000,
 1831350000,
 3256509000,
 1688395000,
 1398411000,
 1934877000,
 2166910000,
 2360282000,
 2248572000,
 1449120000,
 1509427000,
 2014505000,
 1032111000,
 1470590000,
 1901842000,
 1291910000,
 1444695000,
 1427543000,
 1236040000,
 1452967000,
 1477168000,
 1266673000,
 1541442000,
 1907597000,
 1305392000,
 1440759000,
 1196187000,
 832375000,
 879600000,
 1455808000,
 1827371000,
 1417594000,
 1530203000,
 1636125000,
 1076627000,
 1049427000,
 859298000,
 2916345000,
 1240063000,
 815744000,
 1440493000,
 1421491000,
 1223878000,
 1245693000,
 1512748000,
 1818343000,
 2264501000,
 3187811000,
 1849747000,
 1551615000,
 2230736000,
 1740275000,
 2639118000,
 5834564000,
 4022983000,
 3625975000,
 4125792000,
 5064252000,
 5614149000,
 4474861000,
 3744451000,
 4158396000,
 2873879000,
 4043081000,
 4193739000,
 3487034000,
 2712006000,
 4123896000,
 5136789000,
 3678019000,
 3182563000,
 3113542000,
 7117021000,
 2878097000,
 2513484000,
 2980950000,
 2335584000,
 3191460000,
 2712447000,
 1839577000,
 1956721000,
 1789868000,
 1320603000,
 1335203000,
 1092799000,
 1382699000,
 1464518000,
 1290690000,
 0]

In [164]:
volume_sum = volume_sum[:-1]

IF WE QUIT ALL NAN ROWS, WE SHOULD BE LEFT WITH THE EXPIRATION DATE AND COMPANY_ID OF EACH SUM, SO AFTERWARDS IT WILL BE EASY TO CONCAT TO THE PREVIOUS DATAFRAME

In [168]:
volume_date_clean = volume_date.dropna(subset="expiration_date")
volume_date_clean

      Trade Date company_id    Volume expiration_date
12    2013-01-18       TSLA    473000      2013-01-18
31    2013-02-15       TSLA   1005000      2013-02-15
50    2013-03-15       TSLA   2392000      2013-03-15
74    2013-04-19       TSLA   4828000      2013-04-19
94    2013-05-17       TSLA  26632000      2013-05-17
...          ...        ...       ...             ...
14902 2023-04-21       AAPL  62219000      2023-04-21
14922 2023-05-19       AAPL  68098000      2023-05-19
14941 2023-06-16       AAPL  58285000      2023-06-16
14964 2023-07-21       AAPL  68108000      2023-07-21
14984 2023-08-18       AAPL  70634000      2023-08-18

[699 rows x 4 columns]

In [170]:
volume_date_clean ["volume_sum"] = volume_sum

/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_16489/103423086.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  volume_date_clean ["volume_sum"] = volume_sum

In [172]:
volume_date_clean.reset_index(drop=True)

    Trade Date company_id    Volume expiration_date  volume_sum
0   2013-01-18       TSLA    473000      2013-01-18     5770000
1   2013-02-15       TSLA   1005000      2013-02-15    21980000
2   2013-03-15       TSLA   2392000      2013-03-15    23124000
3   2013-04-19       TSLA   4828000      2013-04-19    56304000
4   2013-05-17       TSLA  26632000      2013-05-17   305949000
..         ...        ...       ...             ...         ...
694 2023-04-21       AAPL  62219000      2023-04-21  1335203000
695 2023-05-19       AAPL  68098000      2023-05-19  1092799000
696 2023-06-16       AAPL  58285000      2023-06-16  1382699000
697 2023-07-21       AAPL  68108000      2023-07-21  1464518000
698 2023-08-18       AAPL  70634000      2023-08-18  1290690000

[699 rows x 5 columns]

In [175]:
volume_final = volume_date_clean[["company_id", "expiration_date", "volume_sum"]]

In [176]:
volume_final

      company_id expiration_date  volume_sum
12          TSLA      2013-01-18     5770000
31          TSLA      2013-02-15    21980000
50          TSLA      2013-03-15    23124000
74          TSLA      2013-04-19    56304000
94          TSLA      2013-05-17   305949000
...          ...             ...         ...
14902       AAPL      2023-04-21  1335203000
14922       AAPL      2023-05-19  1092799000
14941       AAPL      2023-06-16  1382699000
14964       AAPL      2023-07-21  1464518000
14984       AAPL      2023-08-18  1290690000

[699 rows x 3 columns]

LET'S JOIN IT TO THE PREVIOUS ONE ON COMPANY_ID AND EXPIRATION DATE (I THINK YOU CAN DO THIS IN SQL WAY FASTER, BUT TOO LATE)

In [177]:
options_almost_complete_info

,expiration_date,company_id,in_the_money,contractSymbol,total_percentage_in_the_money,Call,Put
0,2013-01-18,AAPL,52,111,0.468468,0.000000,1.000000
1,2013-01-18,AMZN,239,472,0.506356,0.000000,1.000000
2,2013-01-18,GOOG,164,341,0.480938,0.000000,1.000000
3,2013-01-18,META,110,240,0.458333,0.038462,0.954545
4,2013-01-18,MSFT,94,193,0.487047,0.000000,1.000000
...,...,...,...,...,...,...,...
803,2023-08-18,GOOG,164,341,0.480938,0.474576,0.487805
804,2023-08-18,META,110,240,0.458333,0.484615,0.427273
805,2023-08-18,MSFT,94,193,0.487047,0.484848,0.489362
806,2023-08-18,NIO,33,66,0.500000,0.441176,0.562500
807,2023-08-18,TSLA,285,574,0.496516,0.280277,0.715789

In [180]:
merged_options_info = pd.merge(options_almost_complete_info, volume_final , on=['expiration_date', 'company_id'])

In [181]:
merged_options_info

,expiration_date,company_id,in_the_money,contractSymbol,total_percentage_in_the_money,Call,Put,volume_sum
0,2013-01-18,AAPL,52,111,0.468468,0.000000,1.000000,791940000
1,2013-01-18,AMZN,239,472,0.506356,0.000000,1.000000,190947000
2,2013-01-18,GOOG,164,341,0.480938,0.000000,1.000000,216438000
3,2013-01-18,MSFT,94,193,0.487047,0.000000,1.000000,127059000
4,2013-01-18,TSLA,285,574,0.496516,0.003460,0.996491,5770000
...,...,...,...,...,...,...,...,...
694,2023-08-18,GOOG,164,341,0.480938,0.474576,0.487805,260441000
695,2023-08-18,META,110,240,0.458333,0.484615,0.427273,609269000
696,2023-08-18,MSFT,94,193,0.487047,0.484848,0.489362,592811000
697,2023-08-18,NIO,33,66,0.500000,0.441176,0.562500,465235000
698,2023-08-18,TSLA,285,574,0.496516,0.280277,0.715789,3104017000

WELL, NO NAN, AS WE HAVE MERGED THEM AND THE VALUES WE HAD OF OPTIONS, HAVE BEEN GONE IF THERE IS NO VOLUME, EITHER WAYS WE WILL SAVE THIS DATAFRAME (ONE WITH ONLY TESLA FOR TESLA) AND ONE FOR THE ALL COMPANIES

In [189]:
merged_options_info_tesla = merged_options_info[merged_options_info['company_id'] == "TSLA"].reset_index(drop = True)
merged_options_info_tesla

,expiration_date,company_id,in_the_money,contractSymbol,total_percentage_in_the_money,Call,Put,volume_sum
0,2013-01-18,TSLA,285,574,0.496516,0.003460,0.996491,5770000
1,2013-02-15,TSLA,285,574,0.496516,0.003460,0.996491,21980000
2,2013-03-15,TSLA,285,574,0.496516,0.003460,0.996491,23124000
3,2013-04-19,TSLA,285,574,0.496516,0.003460,0.996491,56304000
4,2013-05-17,TSLA,285,574,0.496516,0.010381,0.989474,305949000
...,...,...,...,...,...,...,...,...
120,2023-04-21,TSLA,285,574,0.496516,0.193772,0.803509,3729448000
121,2023-05-19,TSLA,285,574,0.496516,0.211073,0.785965,3342549000
122,2023-06-16,TSLA,285,574,0.496516,0.356401,0.638596,4128800000
123,2023-07-21,TSLA,285,574,0.496516,0.356401,0.638596,3930746000
124,2023-08-18,TSLA,285,574,0.496516,0.280277,0.715789,3104017000

In [190]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/musk_twt_tesla_stock'
engine = create_engine(connection_string)

In [191]:
#merged_options_info_tesla.to_sql('tesla_options_info_2013_2023', engine, if_exists='append', index=False)

125

In [193]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/twitter_stock_all'
engine = create_engine(connection_string)

In [194]:
#merged_options_info.to_sql('options_info_2013_2023', engine, if_exists='append', index=False)

699